admindashboardreport/statistics.json
{
  "12 - Verify Product Cleanup" : {
    "transaction" : "12 - Verify Product Cleanup",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.779999999999994,
    "medianResTime" : 21.5,
    "minResTime" : 13.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 33.8,
    "pct2ResTime" : 37.449999999999996,
    "pct3ResTime" : 40.0,
    "throughput" : 0.55344631017345,
    "receivedKBytesPerSec" : 2.594128245962609,
    "sentKBytesPerSec" : 0.2259185133325216
  },
  "01 - Admin Login for Products" : {
    "transaction" : "01 - Admin Login for Products",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 87.98000000000003,
    "medianResTime" : 89.5,
    "minResTime" : 58.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 100.35,
    "pct3ResTime" : 181.0,
    "throughput" : 0.5634120232125753,
    "receivedKBytesPerSec" : 0.35323292861569666,
    "sentKBytesPerSec" : 0.22778572032227168
  },
  "02 - Generate Random Product Data" : {
    "transaction" : "02 - Generate Random Product Data",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.6,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 14.399999999999949,
    "pct3ResTime" : 29.0,
    "throughput" : 0.5567990734863417,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "09 - Product Edit Complete" : {
    "transaction" : "09 - Product Edit Complete",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.240000000000001,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 0.5547850208044383,
    "receivedKBytesPerSec" : 0.09392337031900139,
    "sentKBytesPerSec" : 0.0
  },
  "10 - Delete Product" : {
    "transaction" : "10 - Delete Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.800000000000002,
    "medianResTime" : 15.0,
    "minResTime" : 9.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 24.349999999999987,
    "pct3ResTime" : 27.0,
    "throughput" : 0.5452324871325134,
    "receivedKBytesPerSec" : 0.1725149666317718,
    "sentKBytesPerSec" : 0.2491882851347815
  },
  "13 - Product Cleanup Verification Results" : {
    "transaction" : "13 - Product Cleanup Verification Results",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.7,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 14.0,
    "throughput" : 0.5581291510855613,
    "receivedKBytesPerSec" : 0.1680273971647039,
    "sentKBytesPerSec" : 0.0
  },
  "14 - Final Global Product Check" : {
    "transaction" : "14 - Final Global Product Check",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.020000000000003,
    "medianResTime" : 22.0,
    "minResTime" : 14.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 38.449999999999996,
    "pct3ResTime" : 41.0,
    "throughput" : 0.5614255718119449,
    "receivedKBytesPerSec" : 2.251481023113891,
    "sentKBytesPerSec" : 0.22917567286854781
  },
  "08 - Edit Product" : {
    "transaction" : "08 - Edit Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.43999999999999,
    "medianResTime" : 39.0,
    "minResTime" : 26.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 52.0,
    "pct2ResTime" : 54.89999999999999,
    "pct3ResTime" : 58.0,
    "throughput" : 0.5649972880130175,
    "receivedKBytesPerSec" : 0.4116314226066715,
    "sentKBytesPerSec" : 0.947827091054963
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.510666666666687,
    "medianResTime" : 12.0,
    "minResTime" : 0.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 42.0,
    "pct2ResTime" : 82.44999999999993,
    "pct3ResTime" : 97.0,
    "throughput" : 4.992311839766759,
    "receivedKBytesPerSec" : 4.713320912877502,
    "sentKBytesPerSec" : 1.9405272130918387
  },
  "05 - Verify Created Product" : {
    "transaction" : "05 - Verify Created Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.6,
    "medianResTime" : 21.0,
    "minResTime" : 13.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 33.14999999999997,
    "pct3ResTime" : 38.0,
    "throughput" : 0.5665465587962019,
    "receivedKBytesPerSec" : 0.42097065005552153,
    "sentKBytesPerSec" : 0.2504312835678836
  },
  "11 - Complete Product CRUD Operations" : {
    "transaction" : "11 - Complete Product CRUD Operations",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.56,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.449999999999996,
    "pct3ResTime" : 5.0,
    "throughput" : 0.548137429016203,
    "receivedKBytesPerSec" : 0.15416365191080708,
    "sentKBytesPerSec" : 0.0
  },
  "02 - Get Categories for Product" : {
    "transaction" : "02 - Get Categories for Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.82,
    "medianResTime" : 13.0,
    "minResTime" : 7.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 21.9,
    "pct2ResTime" : 26.89999999999999,
    "pct3ResTime" : 30.0,
    "throughput" : 0.5596409343765041,
    "receivedKBytesPerSec" : 0.7416335429188632,
    "sentKBytesPerSec" : 0.22954022699036297
  },
  "04 - Create New Product" : {
    "transaction" : "04 - Create New Product",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 32.160000000000004,
    "medianResTime" : 31.0,
    "minResTime" : 22.0,
    "maxResTime" : 55.0,
    "pct1ResTime" : 41.9,
    "pct2ResTime" : 45.449999999999996,
    "pct3ResTime" : 55.0,
    "throughput" : 0.5660270560932813,
    "receivedKBytesPerSec" : 0.395157638535122,
    "sentKBytesPerSec" : 0.91868844455765
  },
  "15 - Final EDITED Products Report" : {
    "transaction" : "15 - Final EDITED Products Report",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8000000000000003,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 21.0,
    "throughput" : 0.569988942214521,
    "receivedKBytesPerSec" : 0.08051093808780109,
    "sentKBytesPerSec" : 0.0
  },
  "06 - Product Creation Complete" : {
    "transaction" : "06 - Product Creation Complete",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4800000000000004,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.8999999999999915,
    "pct3ResTime" : 15.0,
    "throughput" : 0.5747985331141435,
    "receivedKBytesPerSec" : 0.07649760165312058,
    "sentKBytesPerSec" : 0.0
  },
  "07 - Generate Updated Product Data" : {
    "transaction" : "07 - Generate Updated Product Data",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6799999999999997,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.449999999999996,
    "pct3ResTime" : 9.0,
    "throughput" : 0.5687635081333182,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}