orderreport/statistics.json
{
  "01 - User Role Assignment" : {
    "transaction" : "01 - User Role Assignment",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 7.700000000000006,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.403213358591174,
    "receivedKBytesPerSec" : 0.1688241072055006,
    "sentKBytesPerSec" : 0.0
  },
  "05 - Member Get Own Orders" : {
    "transaction" : "05 - Member Get Own Orders",
    "sampleCount" : 14,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107.14285714285714,
    "medianResTime" : 99.0,
    "minResTime" : 87.0,
    "maxResTime" : 167.0,
    "pct1ResTime" : 154.5,
    "pct2ResTime" : 167.0,
    "pct3ResTime" : 167.0,
    "throughput" : 1.4220416455053329,
    "receivedKBytesPerSec" : 1529.6377047359065,
    "sentKBytesPerSec" : 0.5693721432199086
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 86,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 53.22093023255813,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 278.0,
    "pct1ResTime" : 135.7,
    "pct2ResTime" : 214.49999999999991,
    "pct3ResTime" : 278.0,
    "throughput" : 5.953617168570439,
    "receivedKBytesPerSec" : 2147.003382982866,
    "sentKBytesPerSec" : 0.9577005451713395
  },
  "02 - User Login" : {
    "transaction" : "02 - User Login",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.85000000000001,
    "medianResTime" : 79.5,
    "minResTime" : 62.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 96.80000000000001,
    "pct2ResTime" : 100.8,
    "pct3ResTime" : 101.0,
    "throughput" : 1.4003640946646128,
    "receivedKBytesPerSec" : 0.9203564801848481,
    "sentKBytesPerSec" : 0.40629704348130513
  },
  "06 - Admin Order Management Summary" : {
    "transaction" : "06 - Admin Order Management Summary",
    "sampleCount" : 6,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.644736842105263,
    "receivedKBytesPerSec" : 0.26983963815789475,
    "sentKBytesPerSec" : 0.0
  },
  "04 - Admin Get All Orders" : {
    "transaction" : "04 - Admin Get All Orders",
    "sampleCount" : 6,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 230.16666666666666,
    "medianResTime" : 218.5,
    "minResTime" : 199.0,
    "maxResTime" : 278.0,
    "pct1ResTime" : 278.0,
    "pct2ResTime" : 278.0,
    "pct3ResTime" : 278.0,
    "throughput" : 1.5357051446122343,
    "receivedKBytesPerSec" : 4077.1891796775017,
    "sentKBytesPerSec" : 0.6208807908881495
  },
  "03 - Order Load Test Report" : {
    "transaction" : "03 - Order Load Test Report",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4999999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.849999999999998,
    "pct3ResTime" : 5.0,
    "throughput" : 1.4305128388527286,
    "receivedKBytesPerSec" : 0.5770247344610543,
    "sentKBytesPerSec" : 0.0
  }
}